token = '671595678:AAGivH03ENhKQMIyAI6ln_PLS6ZMi7ZZ1dc'
description = 'Вас приветствует бот МОСГОРТУР. ' \
                  'Я помогу вам адаптироваться на новом рабочем месте ' \
                  'и познакомлю с основными сервисами' \
                  ' и привилегиями для наших сотрудников.'
history_message1 = 'ГАУК Мосгортур ("Государственное автономное учреждение культуры "Московское агентство организации '\
                   'отдыха и туризма") — крупнейший в России детский туроператор. '
history_message2 = 'Мосгортур занимается организацией детского отдыха и оздоровления и является крупнейшим ' \
                   'организатором отдыха для детей льготных категорий.\n' \
                   'Помимо реализации путёвок в летние лагеря, Мосгортур занимается разработкой программ отдыха, ' \
                   'обучением и трудоустройством вожатых, проблематикой инклюзивного отдыха для детей ' \
                   'с инвалидностью, разработкой стандартов качества детского отдыха и другими вопросами, ' \
                   'связанными с детским отдыхом. '
history_message3 = 'Ежегодно с Мосгортуром отдыхает более 100 000 детей.'
history_message4 = 'В 2014 году в связи с растущими требованиями к обеспечению условий детского отдыха ' \
                   'Департамент культуры города Москвы принял решение о переформатировании ' \
                   'Московского центра детского, семейного отдыха и оздоровления в ' \
                   '«Московское агентство организации отдыха и туризма», сокращённо "Мосгортур"'
history_message5 = 'С 2014 года Мосгортур и Департамент культуры города Москвы начинают реформирование системы ' \
                   'организации детского отдыха в Москве — совместно с жителями Москвы разрабатывается ' \
                   'Московский стандарт детского отдыха, открывается Центральная школа московских вожатых, ' \
                   'создается первый Всероссийский рейтинг представления загородных детских лагерей, ' \
                   'разрабатываются уникальные программы детского отдыха, ' \
                   'методика проверок детских лагерей и многое другое.'

history_message6 = 'Летом 2014 года решением Правительства Российской Федерации компания была назначена единственным ' \
                   'организатором детского отдыха в Крыму.'
history_message7 = 'С 2016 года Мосгортур отвечает за организацию отдыха детей по всем льготным программам ' \
                   'Правительства Москвы. В декабре 2016 года Мосгортуру передана задача по организации отдыха ' \
                   'детей-сирот из учреждений подведомственных Департаменту труда и социальной защиты города Москвы'
history_message8 = 'В сентябре 2017 года по решению Департамента культуры города Москвы Мосгортур был объединен с ' \
                   'Московским центром музейного развития.'
history_message9 = 'Объединенная структура отвечает за продвижение ' \
                   'и популяризацию московских музеев. Это порядка 90 культурных городских площадок.'
services_message = ''
glpi_message = 'GLPI - Центр технической поддержки: установка программ, ' \
               'решение проблем с компьютером и оборудованием, заказ цветной печати. '
glpi_access = 'Для доступа к сервису потребуется:\n' \
              'Логин  - логин от компьютера заглавными буквами\n имя и фамилия без пробелов, (например, TKravchuk).\n' \
              'Пароль - от компьютера.\nНажимаем "создать заявку", заполняем все поля.'
office_message = 'Office 365 - Корпоративные офисные программы: Word, Excel, Outlook, Power Point ' \
                 'и еще 20 полезных программ.'
office_install = 'Для установки необходимо подать заявку на GLPI на ' \
                 'создание почтового ящика и установку пакета Microsoft Office'
edo_message = 'ЭДО - система электронного документооборота Правительства Москвы'
edo_install = 'Для установки необходимо попросить начальника отдела\n' \
              '(или начальника управления) написать служебную записку на открытие обучающего курса в ЭДО.'
ais_message = 'АИС - корпоративный портал: планирование задач, справочник сотрудников, доступ к рабочим областям'
ais_access = 'Для доступа к сервису необходимы Логин и Пароль.\n' \
             'Их можно запросить письмом у Станислава Скрипко sskripko@mosgortur.ru'
helpdesk_message = 'Helpdesk - центр технической поддержки: заявки в АХО на покупку канцелярии, ' \
                   'заказ курьеров, заказ пропуска'
helpdesk_access = 'Для доступа к сервису потребуется:\n' \
                  'Логин - логин от компьютера строчными буквами имя и фамилия без пробелов, (например, tkravchuk).\n' \
                  'Пароль - от компьютера'
megafon_message = 'Корпоративная мобильная связь МегаФон'
megafon_package = 'Что входит в пакет:\n• бесплатные входящие по РФ\n' \
                  '   • безлимитные звонки с коллегами на номера 8-925-5000\n' \
                  '   • 300 минут исходящих в домашнем регионе\n' \
                  '   • 1 Гб интернета на максимальной скорости\n' \
                  '   • 100 СМС на любые номера РФ'
megafon_access = 'Для получения симкарты необходимо подать заявку на GLPI'
articles_message = 'МОСГОРТУР поможет найти подходящую площадку для публикации научной статьи. ' \
                   'Это понадобится при защите кандидатской или докторской степени. ' \
                   'Кандидаты и доктора наук получают в МОСГОРТУРе стимулирующие выплаты'
articles_access = 'Как получить помощь:\n1. Написать письмо Заярской Галине Владимировне ' \
                  '\n(GZayarskaya@mosgortur.ru)' \
                  ' или Фадори Анне Юрьевне\n' \
                  '2. Получить консультацию и помощь в редактуре статьи в соответствии с требованиями к публикациям\n' \
                  '3. Получить помощь в поиске подходящего журнала или сборника.'
camp_message = 'Отправляйте детей в лагерь на самых выгодных условиях.\nПутёвку можно приобрести:\n' \
               '   • с рассрочкой на необходимое количество платежей до даты поездки\n' \
               '   • со скидкой 10%.'
camp_access1 = 'Для получения путёвки нужно зарегистрироваться на сайте МОСГОРТУР'
camp_access2 = 'После регистрации у Вас появится персональный кабинет.\nВ нём вы сможете оформить заказ самостоятельно ' \
               'или связаться с отделом по работе с клиентами для уточнения имеющихся предложений ' \
               'и оформления заказа через менеджера.'
camp_access3 = 'Контакты отдела по работе с клиентами:\n' \
               '+7 495-241-33-76 доб 2\nsale@mosgortur.ru'
sport_message = 'Сети спортивных клубов World Class и XFit предоставляют сотрудникам МОСГОРТУР корпоративные скидки ' \
                'и другие возможности. Здесь вы можете узнать о них подробнее.'
worldclass_message = 'Корпоративная программа World Class- это:\n' \
                     '   • скидки на годовые и полугодовые клубные карты до 40%\n' \
                     '(корпоративная и сезонные скидки суммируются)\n' \
                     '   • скидки распространяется на сотрудников и членов их семей\n' \
                     '   • сеть спортивных клубов World Class - это 38 спортивных клубов в Москве и ' \
                     'ближайшем Подмосковье\n' \
                     '   • в программу тренировок входят 50 видов групповых программ\n' \
                     '   • первые два визита - бесплатно.\n' \
                     'Вы можете воспользоваться ими сами или сходить вместе с кем-то из друзей и родных.'
worldclass_access = 'Что нужно сделать, чтобы получить корпоративную скидку на абонемент:\n' \
                    '1. со своей корпоративной почты ( ...@mosgortur.ru) отправить заявку нашему персональному ' \
                    'менеджеру в World Class\n' \
                    '2. в заявке необходимо указать ФИО, дату вашего рождения и контактный телефон\n' \
                    '3. менеджер из World Class свяжется с вами, проконсультирует и запишет на первый пробный визит.'
worldclass_access3 = 'Контакты менеджера в World Class:\n{}'
worldclass_pricelist = 'https://mosgortur-my.sharepoint.com/personal/dgranovskaya_mosgortur_ru/_layouts/15/onedrive.' \
                       'aspx?id=%2Fpersonal%2Fdgranovskaya_mosgortur_ru%' \
                       '2FDocuments%2F%D0%92%D0%BB%D0%BE%D0%B6%D0%B5%D0%BD%D0%B8%D1%8F%2F%D0%9A%D0%BE%D1%80%D0%BF%D0%' \
                       'BE%D1%80%D0%B0%D1%82%D0%B8%D0%B2%D0%BD%D1%8B%D0%B9%20%D0%BF%D1%80%D0%B0%D0%B9%D1%81%20NEW%20%' \
                       '202018-%20%D0%B8%D1%8E%D0%BB%D1%8C%2Epdf&parent=%2Fpersonal%2Fdgranovskaya_mosgortur_ru%' \
                       '2FDocuments%2F%D0%92%D0%BB%D0%BE%D0%B6%D0%B5%D0%BD%D0%B8%D1%8F'
xfit_message = 'Тренировки в X-FIT - это:\n' \
               '   • запатентованная система тренировок SMART FITNESS, ' \
               'позволяющая развивать основные физические качества,' \
               ' достигать быстрых и пролонгированных результатов\n' \
               '   • актуальные новинки фитнес-индустрии: бассейны с морской водой, ' \
               'тренажерные залы с инновационным оборудованием, сайкл-студия, ' \
               'программы единоборств и танцевальные занятия\n' \
               '   • элитный тренерский состав: в сети работают и преподают эксперты, ' \
               'международные презентеры, разработчики уникальных тренерских методик\n' \
               '   • возможность посещать клубы в других городах в момент деловых и личных поездок\n' \
               '   • дополнительные услуги, позволяющие членам клубов ускорить процесс достижения целей: ' \
               'кабинеты фитнес-тестирования и массажа, сауны, ' \
               'SPA-салоны и фитнескафе Fresh-Fit с полезными и вкусными блюдами\n' \
               '   • 18 клубов в Москве и 15 в регионах – XFIT федеральная сеть фитнес-клубов\n' \
               'Корпоративное предложение доступно не только сотрудникам компании, но и их родным и друзьям!'
xfit_access = 'Что нужно сделать, чтобы получить корпоративную скидку на абонемент:\n' \
              '1. со своей корпоративной почты ( ...@mosgortur.ru) ' \
              'отправить заявку нашему персональному менеджеру в XFIT\n' \
              '2. в заявке необходимо указать ФИО, контактный телефон, выбранный вами клуб и дату визита\n' \
              '3. менеджер из X-FIT свяжется с вами, проконсультирует и запишет на первый пробный визит.'
xfit_access3 = 'Контакты менеджера в X-FIT:\n{}'
insurance_message = 'PECO-гарантия предоставляет сотрудникам МОСГОРТУР преимущества при оформлении страхования. ' \
                    'Больше о компании на сайте: '
insurance_message2 = 'Здесь Вы можете узнать о преимуществах подробнее'
insurance_access = '2. написать письмо: {}\n' \
                   '(приложить сканы документов из п. 1)\n' \
                   '3. получить расчет стоимости\n' \
                   '4. оплатить услугу онлайн\n' \
                   '5. получить страховку в офисе МОСГОРТУРа'
access_message = 'Как получить:'
osago_message = 'ОСАГО\nПреимущества:\n' \
                '   • специальные цены для сотрудников МОСГОРТУР\n' \
                '   • дистанционное оформление'
osago_doc = '1. Подготовить сканы документов:\n' \
                '   • паспорт\n' \
                '   • полис ОМС\n' \
                '   • свидетельство о регистрации ТС\n' \
                '   • водительское удостоверение\n' \
                '   • номер телефона для связи'
home_insurance_message = 'Страхование Имущества\nПреимущества:\n' \
                         '   • специальные цены для сотрудников МОСГОРТУР\n' \
                         '   • дистанционное оформление'
home_insurance_doc = '1. Подготовить сканы документов:\n' \
                     '   • паспорт\n' \
                     '   • адрес регистрации по месту жительства\n' \
                     '   • площадь квартиры\n' \
                     '   • телефон для связи'
green_card_message = 'Международное страхование автогражданской ответственности Зеленая карта\nПреимущества:\n' \
                     '   • специальные цены для сотрудников МОСГОРТУР\n' \
                     '   • дистанционное оформление'
green_card_doc = '1. Подготовить сканы документов:\n' \
                 '   • паспорт\n' \
                 '   • свидетельство о регистрации ТС\n' \
                 '   • водительское удостоверение\n' \
                 '   • номер телефона для связи'
dms_message = 'ДМС\nПреимущества:\n' \
              '   • компенсация стоимости полиса 19000 руб.\n' \
              '   • специальные цены для членов семьи сотрудника\n' \
              '   • дистанционное оформление'
dms_doc = '1. Выбрать на сайте услуги ДМС'
data_base_name = 'users'
bot_base_name = 'chats'
links_base_name = 'links'
start_authorization_message = 'Для того, чтобы меня использовать, необходимо авторизоваться, ' \
                              'но Вы можете получить доступ к некоторым функциям, если войдёте как гость'
menu_user_help_message = 'Приветствую в Главном Меню!\n' \
                         'Здесь доступны все функции бота:\n' \
                         '• Нажмите "История" и я расскажу Вам об истории МОСГОРТУР\n' \
                         '• В разделе "Сервисы" можно получить информацию о различных сервисах, ' \
                         'доступных сотрудникам компании\n' \
                         '• В разделе "Привилегии" я расскажу Вам о привилегиях, предоставляемых компанией\n' \
                         '• Раздел "Навигация" поможет связаться с другими сотрудниками\n' \
                         '• В разделе "Личный кабинет" можно изменить информацию о себе и выйти из системы\n' \
                         '• В разделе "Обратная связь" можно найти контакты людей, ' \
                          'которым можно задать любые вопросы \n' \
                         '• Если при работе с ботом возникнут проблемы, просто отправьте команду /menu или /start'
menu_admin_help_message = 'Приветствую в Главном Меню!\n' \
                         'Здесь доступны все функции бота:\n' \
                         '• Нажмите "История" и я расскажу Вам об истории МОСГОРТУР\n' \
                         '• В разделе "Сервисы" можно получить информацию о различных сервисах, ' \
                         'доступных сотрудникам компании\n' \
                         '• В разделе "Привилегии" я расскажу Вам о привилегиях, прилоставляемых компанией\n' \
                         '• Раздел "Навигация" поможет связаться с другими сотрудниками\n' \
                         '• В разделе "Личный кабинет" можно изменить информацию о себе и выйти из системы\n' \
                         '• В разделе "Администрирование" Вы можете \nдобавлять/удалять ' \
                          'сотрудников и делать рассылки\n' \
                         '• В разделе "Обратная связь" можно найти контакты людей, ' \
                          'которым можно задать любые вопросы\n' \
                          '• Если при работе с ботом возникнут проблемы, просто отправьте команду /menu или /start'
account_help_message = 'В Личном кабинете Вы можете:\n' \
                       '• Изменить логин/пароль/фото/информацию о себе, нажав на соответствующую кнопку\n' \
                       '• Выйти из учётной записи, нажав "Выход"'
self_none_self_info = 'Вы еще не сообщили ничего о себе :('
self_information_help_message = 'Рекомендую добавить:\n' \
                                '• Контактный номер телефона\n' \
                                '• Адрес электронной почты\n' \
                                '• Время, в которое с вами можно связаться\n' \
                                '• Что угодно, на Ваш выбор :)\n'
bot_user_delete = 'Введите id или ФИО пользователя, которого хотите удалить'
user_list = '📄Список пользователей'
user_info = '▫ *id:* {}\n*ФИО:* {}\n*Должность:* {}\n'
department_ask = 'Показать всех пользователей или пользователей из определённого управления?'
section_ask = 'Показать всех пользователей из управления или пользователей из определённого отдела?'
user_insert = ''
photo_adress = ''
bot_user_insert = 'Введите ЛОГИН и ПАРОЛЬ для пользователя\n' \
                  '# Пароль должен быть НЕ КОРОЧЕ 9 символов, содержать БОЛЬШИЕ и МАЛЕНЬКИЕ буквы и ЦИФРЫ'
access_level_message = 'Введите уровень доступа добавляемого сотрудника:\n• 0 - рядовой сотрудник\n' \
                       '• 1 - глава отдела\n• 2 - глава управления\n• 3 - гендиректор/зам.гендиректора\n'
admin_menu_help_message = 'В данном меню вы можете управлять сотрудниками:\n' \
                          '• Для удаления/добавления сотрудника нажмите на соответствующую кнопку ' \
                          'и следуйте инструкции' \
                          '\n• Нажав на кнопку "Рассылка", Вы можете отправить сообщение выбранным пользователям{}'
user_information_message = 'ID:\t\t{}\nФИО:\t\t{}\nУправление:\t\t{}\nОтдел:\t\t{}\nДолжность:\t\t{}'
start_menu_message = '• Для того чтобы войти, нажмите на кнопку "Вход" и введите логин и пароль, ' \
                     'если у Вас их нет, то обратитесь к Администратору\n• Войдя как гость, ' \
                     'Вы сможете узнать об истории компании и' \
                     'привилегиях, доступных сотрудникам, для этого нажмите "Войти как гость"\n• В разделе ' \
                     '"Обратная связь" Вы можете узнать контакты людей, к которым можно обратиться по любым вопросам'
guest_menu_help_message = 'Добро пожаловать в гостевое меню!\n' \
                          '• Нажмите "История" и я расскажу Вам об истории МОСГОРТУР\n' \
                          '• В разделе "Привилегии" можно узнать о привилегиях, доступных сотркудникам компании\n' \
                          '• В разделе "Обратная связь" можно найти контакты людей, ' \
                          'которым можно задать любые вопросы\n'\
                          '• Вы всё ещё можете войти в систему, нажав на кнопку "Вход"\n' \
                          '• Для возврата в начальное меню отправьте команду /start_menu'
generate_button_help = 'При нажатии кнопки "Сгенерировать", Логин и Пароль будут созданы автоматически'
skip_button_help = 'При нажатии кнопки "Пропустить", фотография будет создана автоматически'
feedback = 'В случае возникновения любых вопросов вам помогут:\n' \
           '• Ксения Трепыхалина тел. +7(925)500-09-10, почта ktrepyhalina@mosgortur.ru\n' \
           '• Дарья Грановская тел. +7(919)-961-06-33, почта DGranovskaya@mosgortur.ru\n'
simple_list_ask = 'Вы можете увидеть список всех пользователей, или выбрать определённое управление и отдел'
navigation_message = 'В данном разделе Вы можете получить информацию о других сотрудниках компании.\n' \
                     'Для этого нажмите кнопку "Сотрудники"'
world_class_application = 'worldclass'
xfit_application = 'xfit'
mailing_ask = ''
mailing_help1 = 'Выберете, каким пользователям будет отправлено сообщение. при нажатии на кнопку "Все", ' \
                'сообщение будет отправлено всем сотрудникам отдела'
mailing_help2 = 'Выберете отделы, сотрудникам которых Вы хотите отправить сообщение. \n' \
                'Вы можете выбрать определенных пользователей из данного управления, нажав на соответствующую кнопку.' \
                '\nПри нажатии на кнопку "Все", сообщение будет отправлено всем сотрудникам управления.'
mailing_help3 = 'Выберете управления, сотрудникам которых Вы хотите отправить сообщение.\n' \
                'Вы можете выбрать определенных пользователей из всех управлений, нажав на соответствующую кнопку,\n' \
                'При нажатии на кнопку "Все", сообщение будет отправлено всем сотрудникам всех управлений.'
mailing_help4 = '*help4*'
mailing_choose_users = 'Введите id пользователей, которым хотите сделать рассылку (через пробел)\n' \
                       'При нажатии на кнопку "Все", сообщение будет отправлено всем пользователям'
sport_application_xfit = 'Добрый день! Я сотрудник ГАУК «Мосгортур».\nЯ хочу оформить абонемент в клуб ' \
                    '{}. Мои данные:\nТелефон: {}\nДата визита: {}\n{}'
sport_application_wc = 'Добрый день! Я сотрудник ГАУК «Мосгортур».\nЯ хочу оформить абонемент в клуб ' \
                       'World Class. Мои данные:\nТелефон: {}\nДата рождения: {}\n{}'
english_message1 = 'Учите английский язык в любом месте в любое время в школе SKYENG!'
english_message2 = '🆓Бесплатно!'
english_message3 = 'Общие условия:\n• занятия по скайпу в любое время в любом месте\n ' \
                   '• курсы состоят из 8, 16, 32, 64 уроков\n' \
                   '• первый урок пробный и бесплатный\n' \
                   '• далее стоимость рассчитывается исходя из цены 690 руб. - один урок.'
english_message4 = 'Условия компенсации:\n' \
                   '• 50% компенсация стоимости начисляется в стимулирующие выплаты при оплате любого курса\n' \
                   '• остальные 50% после успешного завершения курса'
english_message5 = 'Для получения компенсации и отправьте скриншот платёжки на почту Грановской Дарье ' \
                   '(dgranovskaya@mosgortur)' \
                   'Вы также можете задать любые вопросы 📞+7(925)500-02-93.'
password_limit_message = '❗Исчерпан лимит попыток ввода пароля. Попробуйте ещё раз через '
user_error_message = "Упс :( Что-то пошло не так. Сообщение об ошибке отправлено разработчику. " \
                            "По возможности, пришлите скриншот с ошибкой ему в Telegram: Попробуйте ещё раз."
links_change_message = 'Изменить можно следующие ссылки и информацию:\n*Название* - Описание\n{}'
admin_menu_links_message = '\n• Нажав на кнопку "Ссылки", Вы можете менять ссылки и контакты в боте'
mgt_sender_names = ['Грановская Дарья Федоровна']
